test/pimpleFoam_pipe_RANS/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    topPatch
    {
        type            patch;
        nFaces          1544;
        startFace       931100;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1544;
        startFace       932644;
    }
    bottomPatch
    {
        type            patch;
        nFaces          46496;
        startFace       934188;
    }
)

// ************************************************************************* //
