test/pimpleFoam_pipe_RANS/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          0;
        startFace       500044;
    }
    auto0
    {
        type            patch;
        nFaces          1544;
        startFace       500044;
    }
    auto1
    {
        type            wall;
        nFaces          46496;
        startFace       501588;
    }
    auto2
    {
        type            patch;
        nFaces          1544;
        startFace       548084;
    }
}


/*

T
{
    internalField   uniform 300;

    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
            value           uniform 300;
        }
        "heater_to_.*"
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           uniform 300;
        }

        heater_to_leftSolid
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            thicknessLayers (1e-3);
            kappaLayers     (5e-4);
            value           uniform 300;
        }

        minY
        {
            type            fixedValue;
            value           uniform 500;
        }
    }
}
*/

// ************************************************************************* //
